["[{\"comment_id\":\"1002918163114826\",\"message\":\"Exactly what can we do about Gun Violence? Really I'm asking the question that nobody seems to be talking about, or if they are it's not getting much air time. What can be done? I am all for the second amendment, I haven't fired a weapon in a few years but in the past I hunted and when I could afford it I went to the range. I have a friend who will deny knowing me that owns a private weapons mfg. co. That has said that up to 20% of hand guns made are grey market sales and can be brought by anyone. The profit made by the Big weapons co's is astounding and virtually untouchable.\"},{\"comment_id\":\"1008921625824807\",\"message\":\"Idiot Politicians like You John\"},{\"comment_id\":\"10152464963287396\",\"message\":\"Your all talk and no action.... You have been in Washington way to long and by the way vote you clearly have proven you rather be everything that's wrong with our government. Your Frankly Speaking is nothing but horse manure. Enjoy your next 2 years of getting a paycheck from the taxpayers and special interest groups for not doing your job. You have forgotten why the people chose you to represent them. Either way Republican or Democrats they are equally the same and together they equal the most dysfunction body of government.\"},{\"comment_id\":\"10152908931311601\",\"message\":\"Oooooo I bet they're scared now.... Cut funding dammit!!!\"},{\"comment_id\":\"10153034095781551\",\"message\":\"Great job Henry!!\"},{\"comment_id\":\"10153086897296129\",\"message\":\"If there was any principled leadership in the House and the Senate, funding could be removed from the butchers of P.P.   All $500,000,000 of it.  Knowing what they do, and choosing to continue to support it, puts blood on the hands of Congress.\"},{\"comment_id\":\"10153172593197634\",\"message\":\"Thanks for your vote against government funding of an organization whose practices are so abhorrent to so many citizens.  For the record, Planned Parenthood does not provide well baby care, and has never offered mammograms.\"},{\"comment_id\":\"10153228677754415\",\"message\":\"This is what's coming out of people's taps in California right now.    http://www.addictinginfo.org/2015/01/30/black-foul-smelling-sludge-pours-from-taps-in-california-as-fracking-takes-its-toll-video/\"},{\"comment_id\":\"10153237691185600\",\"message\":\"Wow! Thank you for recognizing a need that will help the poor from falling behind.\"},{\"comment_id\":\"10153436080759110\",\"message\":\"I agree with David  and dislike the Sierra  Club.\"},{\"comment_id\":\"10153474416467230\",\"message\":\"Thank you.\"},{\"comment_id\":\"10153572370177034\",\"message\":\"http://2.bp.blogspot.com/-9gJwulXnO_o/Ue8hgkh4YkI/AAAAAAABCT8/1o4qQ40IjHQ/s1600/GMAuthoritiesnew1.jpg  Monsanto is probably the biggest agricultural biotech company, and they make about 15 billion a year.  They bought all these organizations?\"},{\"comment_id\":\"10153705537450653\",\"message\":\"https://www.facebook.com/keith.rubino/videos/10154370113972527/\"},{\"comment_id\":\"10153711145932807\",\"message\":\"What makes you think the redneck doomsday survivalist militiamen in those \\\"\\\"\\\"\\\"tring camps\\\"\\\"\\\"\\\" are Muslim?\"},{\"comment_id\":\"10153740560472006\",\"message\":\"Thank you, Congressman Johnson.\"},{\"comment_id\":\"10153749992589862\",\"message\":\"What a dumb fcuk.  You may have well as made a campaign donation to President Trump.  Good Job Brad.  I had no idea people were this stupid.\"},{\"comment_id\":\"10153760938112006\",\"message\":\"Your done Johnson. Kiss your job goodbye.\"},{\"comment_id\":\"10154107604310196\",\"message\":\"http://www.conservativedailyreview.com/george-soros-and-select-liberals-caught-in-scheme-to-expand-muslim-immigration/?utm_source=Facebook&utm_medium=CDR&utm_campaign=JC\"},{\"comment_id\":\"10154163230287230\",\"message\":\"I could care less however a journalist should not be biased, 1) by dissing trump she is showing her bias, and 2) by praising her race while calling those of other races racist is in itself racist\"},{\"comment_id\":\"10154291250928094\",\"message\":\"Thank you, Congressman McDermott!!!!  It is totally incomprehensible that a common-sense thing like keeping firearms out of the hands of dangerous people should have been blocked for so long by so few people, funded by a crazed organization with no motive other than their own profits.  Please keep fighting for us, Congressman!!!!\"},{\"comment_id\":\"10154352109258424\",\"message\":\"Now can you get the Dept of Agriculture to put back all the animal inspections reports?\"},{\"comment_id\":\"10154387998764789\",\"message\":\"Now what you are you going to do about the guns and bigotry that drove the shooting?\"},{\"comment_id\":\"10154486729647815\",\"message\":\"I called your office to request a townhall. If you are so \\\"\\\"\\\"\\\"excited\\\"\\\"\\\"\\\" to help an authoritarian baffoon like Trump harm the environment and citizens of this country, then I'm sure you can't wait to talk to your constituents about this and explain to us why this makes you \\\"\\\"\\\"\\\"excited\\\"\\\"\\\"\\\" .\"},{\"comment_id\":\"10154532337152287\",\"message\":\"it is true, Congressman Lamborn's staff has always been great!  Thanks for all you do for 5th district Veterans, especially my Marine Vietnam Vet your staff assisted through our VA issues towards quality of life here in Colorado Springs to get our Special Adapted Housing and Special Adapted Vehicle.  We are blessed!\"},{\"comment_id\":\"10154620304886142\",\"message\":\"God bless you Mrs. Capps. And thank you for all your hard work in congress. You will be missed.\"},{\"comment_id\":\"10154703469514122\",\"message\":\"I wonder why you people keep saying \\\"\\\"\\\"\\\"white nationalists or white nationalism.\\\"\\\"\\\"\\\" That's a misnomer! The goons you call \\\"\\\"\\\"\\\"white nationalists\\\"\\\"\\\"\\\" are raw \\\"\\\"\\\"\\\"white supremacist thugs!\\\"\\\"\\\"\\\" They know nothing about nationalism or nationalistic ideology. They are illiterate \\\"\\\"\\\"\\\"white trash,\\\"\\\"\\\"\\\" most of whom can hardly spell their own names. They just happen to have watched a lot of Hitler and Nazi videos and like the idea of Hitler's ethnic cleansing of non-Caucasians in the pre-WW2 years. In all ramifications, they are radical Neo-Nazi fundamentalists, just like the radical Muslim fundamentalists you also call \\\"\\\"\\\"\\\"terrorists.\\\"\\\"\\\"\\\" So, stop pretending and call them what they really are. The are \\\"\\\"\\\"\\\"TERRORISTS\\\"\\\"\\\"\\\" Period!!\"},{\"comment_id\":\"1015482325168768\",\"message\":\"Governor Nathan Deal, needs to grant all Georgian's, his resignation.\"},{\"comment_id\":\"10154954771498632\",\"message\":\"Politicians who are supporting the direction of the current administration have lost the trust of their constituents and won't be re-elected. Trump supporters may have been naive and frustrated but will hopefully swallow their party pride and turn this around at their next opportunity at the polls!  Need to remember their senators and representatives are employed by them; they shouldn't have better healthcare than their bosses!\"},{\"comment_id\":\"10155607356085597\",\"message\":\"Good for everyone that voted \\\"\\\"\\\"\\\"dumbo\\\"\\\"\\\"\\\" in for another 4 years!\"},{\"comment_id\":\"10158294574690131\",\"message\":\"Hate crime is a made up term. It's difficult to track something made up. You can't prove what's in someone's mind which would be necessary to prove \\\"\\\"\\\"\\\"hate\\\"\\\"\\\"\\\".\"},{\"comment_id\":\"10158647761630131\",\"message\":\"Thank you for being a true honest representative for the people you serve.\"},{\"comment_id\":\"1026386207415806\",\"message\":\"Keep spewing your hatred, Marino. You and your Trump are responsible for the present climate.\"},{\"comment_id\":\"1034611649999364\",\"message\":\"Counting on you and your colleagues. Let's get this thing going!\"},{\"comment_id\":\"1056359364408464\",\"message\":\"Congratulations!<f0><U+009F><U+008E><U+0089><f0><U+009F><U+008E><U+0089>\"},{\"comment_id\":\"1096844947074457\",\"message\":\"Thats unbelievable.\"},{\"comment_id\":\"1104038986282528\",\"message\":\"187654104587692 I love your cover photo of you with the classroom of children. Please ensure that these children have an abundance of wild lands and wild animals to admire for generations to come. Please OPPOSE the SHARE ACT (HR 2406), or the \\\"\\\"\\\"\\\"Sportsmen's Act\\\"\\\"\\\"\\\" when it goes up for vote later this week. Carnivores are an integral part of the ecosystem and wanton killing is not the moral solution to appease interest groups. Hunting per se is not a crime - but trophy hunting should not be acceptable for the sole reason of leaving an uncertain future for our children. Please do what is right in your heart. Please oppose the \\\"\\\"\\\"\\\"Sportsmen's Act\\\"\\\"\\\"\\\".\"},{\"comment_id\":\"1116817345027397\",\"message\":\"This is about schools.  Many states have transgender laws, for many years, and have had no problem with it.  If you don't think transgender are already using restrooms in this way, you are mistaken.  This wouldn't even be an issue if some states hadn't made some stupid laws that can't be enforced.  It's an ignorant political game.  I'm sick of it.\"},{\"comment_id\":\"1136646993084432\",\"message\":\"\"},{\"comment_id\":\"1144844945542229\",\"message\":\"I am afraid I do not have much faith in Congress, or the House.\"},{\"comment_id\":\"1238872996185497\",\"message\":\"Nothing.. wants to take away what little we have\"},{\"comment_id\":\"1244427345594017\",\"message\":\"Good.\"},{\"comment_id\":\"1252348314878874\",\"message\":\"Yes, exactly. We've all seen just how thoughtful and carefully planned these regulations are.   I'm sure we'd all love to talk more about this in person, Congressman! Will you be attending the town hall in our district tomorrow?\"},{\"comment_id\":\"1271768379515935\",\"message\":\"Great for our state!\"},{\"comment_id\":\"1309660202425618\",\"message\":\"We need to Quit sending money to the Middle East. If we have the extra money; we should apply it to our Overwhelming National Debt imo.\"},{\"comment_id\":\"1312070308836706\",\"message\":\"I am so disappointed in Senator Masto who voted in Ben Carson.  You owe those who voted to put you in office an explanation.\"},{\"comment_id\":\"1356323147727353\",\"message\":\"fyi I was not at the farm when harley was alive or dead, never knew that cat LIAR! boy you really don't know shit now do you TOM?\"},{\"comment_id\":\"1363380167037779\",\"message\":\"\\\"\\\"\\\"\\\"they thought they were free\\\"\\\"\\\"\\\"   thanks again 10207532826175654  It would be a great lesson for Will to read it.\"},{\"comment_id\":\"1383478935020279\",\"message\":\"Shame on participating in the Inaugural. Absolute Shame! Bibi is a thug, just like trump. Shame. This is now way for our Democracies to behave!\"},{\"comment_id\":\"1417376188281672\",\"message\":\"A law is only worthwhile if this charged with enforcing it are willing to do so... When a candidate for education secretary refuses to guarantee that she will enforce it them I don't have much faith that she will.\"},{\"comment_id\":\"1426928390660251\",\"message\":\"Representative Walberg, we have over 400 people in Jackson here to speak with you today.\"},{\"comment_id\":\"1434031049943046\",\"message\":\"Lies\"},{\"comment_id\":\"1438158422895221\",\"message\":\"You are a poor representation of your constituency...\"},{\"comment_id\":\"1443879238980248\",\"message\":\"Everytime he and his family stay in a resort or tower that they own....they are making millions.  They should have to donate the secret service rooms, or do without\"},{\"comment_id\":\"1447483208599536\",\"message\":\"Great pic cousin!\"},{\"comment_id\":\"1448477938528090\",\"message\":\"Thank you!\"},{\"comment_id\":\"1504653326231483\",\"message\":\"By all means promote religious liberty - but your faith should not interfere with my freedoms. How does a woman's right to choose affect your right to follow your faith.\"},{\"comment_id\":\"1563208350360178\",\"message\":\"TOTALLY wrong. We are endangering our drinking  water and environment for greedy oil companies.\"},{\"comment_id\":\"1578204978860691\",\"message\":\"Welfare is only for \\\"\\\"\\\"\\\"Undocumented Citizens\\\"\\\"\\\"\\\".\"},{\"comment_id\":\"1580331485623636\",\"message\":\"Happy Birthday.\"},{\"comment_id\":\"1751533778407119\",\"message\":\"Good job Brendan!\"},{\"comment_id\":\"1766448213642173\",\"message\":\"It ends Ted when REAL AMERICANS have had enough of this Politically Correct joke we call congress and WE THE PEOPLE, BTW we are STILL the majority, vote these idiots out!!!!!\"},{\"comment_id\":\"1805194766412189\",\"message\":\"So proud of you Barry. A simple Thank you does not seem to be enough.\"},{\"comment_id\":\"1810830905848575\",\"message\":\"Charity Navigator 4 Star for 7 years in a row.  Preserve both Civil War and Revolutionary War battle sites.  My favorite charity,       http://www.civilwar.org/\"},{\"comment_id\":\"1812329772312355\",\"message\":\"1033110603494418 I bet u say those things and profess to be a Christian.  Johnny went to church on Sunday and Johnny went to hell for what he did on Monday.  Talk about a hater.\"},{\"comment_id\":\"1827477177514481\",\"message\":\"Russia hacked my Fruit Salad - to make me vote for Trump- we are through the looking glass here- people\"},{\"comment_id\":\"384641928383229\",\"message\":\"Congratulations\"},{\"comment_id\":\"428465134021371\",\"message\":\"potus enforces a law when its against the citizens defending this country.  time to go!!\"},{\"comment_id\":\"591587791000977\",\"message\":\"You too?\"},{\"comment_id\":\"618279815011704\",\"message\":\"You are wrong.  What AND who puts people on the NF list?  And now you are suggesting we take guns unconstitutionally?\"},{\"comment_id\":\"621064134744400\",\"message\":\"Congratulations,  thrilled to have you represent  us again!\"},{\"comment_id\":\"634964310021049\",\"message\":\"There is a Law in the Books \\\"\\\"\\\"\\\"Law of the Land\\\"\\\"\\\"\\\"  Thanks to our ForeFathers <f0><U+009F><U+0087><U+00BA><f0><U+009F><U+0087><U+00B8><f0><U+009F><U+0087><U+00BA><f0><U+009F><U+0087><U+00B8><f0><U+009F><U+0087><U+00BA><f0><U+009F><U+0087><U+00B8>\"},{\"comment_id\":\"711304355672908\",\"message\":\"Ask the millions who now have health insurance how they feel about it. And the people I know, who have studied the Iran deal and not relied on Fox and Co., as well an international consortium of nuclear scientists, all know the deal is solid. You'll see.\"},{\"comment_id\":\"717547001715310\",\"message\":\"Why\"},{\"comment_id\":\"777803795706987\",\"message\":\"Great job, Mr. Chairman!  Right out of Bill Young's playbook...\"},{\"comment_id\":\"836672843072416\",\"message\":\"Thank you!\"},{\"comment_id\":\"895302837232739\",\"message\":\"Need a very dislike button.\"},{\"comment_id\":\"899070076856015\",\"message\":\"The worst do nothing congress,  that's a true fact.\"},{\"comment_id\":\"918214931630511\",\"message\":\"The salient ratio is debt interest to revenues.\"},{\"comment_id\":\"921651847866181\",\"message\":\"Easter is the celebration of Christ suffering on the cross, , shed blood, death, burial and resurrection.  All of this for a singular purpose, our Salvation. For any one to be speaking of The sins of others and not be concerned about his own is out of place and not worthy of this man or any other. Certainly if he was knowledgeable of  the nature of sin he would no that we are all sinners and not one of us is found worthy on our own.\"},{\"comment_id\":\"928997077151326\",\"message\":\"Fine  Fine<f0><U+009F><U+0098><U+0081>\"},{\"comment_id\":\"962657757169247\",\"message\":\"No he tried before it was unconstitutional...\"},{\"comment_id\":\"973324882786417\",\"message\":\"Vivitrol - Free for all. Anyone who is clean enough to have the shot and WANTS it should be able to get it.\"},{\"comment_id\":\"975041705906688\",\"message\":\"Must watch !!!!! Listen to this bullshit here\"},{\"comment_id\":\"978356865584841\",\"message\":\"Thank you, Rep Nolan for standing with your constituents and supporting Bernie Sanders for President!  It is the fair thing to do and the right thing to do. Your integrity is appreciated!\"},{\"comment_id\":\"10152583569968663\",\"message\":\"Sounds good, I just pray that they follow through.\"},{\"comment_id\":\"10152681600155178\",\"message\":\"Margi Grein...my cousin Glenna E Smith works on the staff of Heller...\"},{\"comment_id\":\"10152912524903878\",\"message\":\"So first they lower taxes on capital income; then they used \\\"\\\"\\\"\\\"carried interest\\\"\\\"\\\"\\\" to turn labor income (for hedge-fund managers and others of their ilk) into capital income, and then they try to eliminate the estate tax so their children won't even have to bother with doing any work at all!\"},{\"comment_id\":\"10152975620059812\",\"message\":\"Thank you for your service.\"},{\"comment_id\":\"10153017106983663\",\"message\":\"THANK YOU Ma'am!  Please Stand with Rand to DEFUND PLANNED PARENTHOOD!\"},{\"comment_id\":\"10153034400032870\",\"message\":\"Joe, do you work a 40 hour week? Thank a union! Do you get overtime? Thank a union! Does your workplace have safety standards? Thank a union. Do you have young children that don't have to work? Thank a union! And we are failing our children because of GW Bush and \\\"\\\"\\\"\\\"no child left behind\\\"\\\"\\\"\\\"! Once we started teaching to the test, the quality of education went down. Add social promotion to that and well......functionally illiterate young people going into college. And of course we have the great right wing focus on $$$$. Do NOT blame teachers unions for the failing educational system. And, lest you think I don't know what I'm talking about, I was a member of the Durango School Board in the 80s! So, I would suggest you might want to think about your position a little more!\"},{\"comment_id\":\"10153054419896977\",\"message\":\"Except that in the US, if you're a woman of childbearing age it's almost impossible to get sterilized.\"},{\"comment_id\":\"10153092372711234\",\"message\":\"So, 4 here, ten there out of how many millions? BTW, I see mostly charges not convictions. I remember a quote \\\"\\\"\\\"\\\"you can indict a ham sandwich\\\"\\\"\\\"\\\".   http://www.usnews.com/opinion/blogs/robert-schlesinger/2012/11/20/the-108-ohio-obama-voter-fraud-myth-and-the-recount-petition  http://www.snopes.com/politics/ballot/2012fraud.asp  Should I publish all the links where Republican Governors purged hundreds of thousands from voting rolls in an attempt to suppress the vote?\"},{\"comment_id\":\"10153123819146747\",\"message\":\"More lies from the left\"},{\"comment_id\":\"10153265353496868\",\"message\":\"MY she be at peace!\"},{\"comment_id\":\"10153426491001977\",\"message\":\"Medicaid, free clinics, and Obamacare provide paps and breast exams. These options do not donate millions of tax payer dollars to pro-Dem causes nor to Democratic candidates at all levels of politics.\"},{\"comment_id\":\"10153477039751682\",\"message\":\"Ronald Reagan did nothing for Louisiana.\"},{\"comment_id\":\"10153535034257530\",\"message\":\"Polis you are a coward. No more support from me for you re-election\"},{\"comment_id\":\"10153573864179039\",\"message\":\"Yes, we agree that you are a joke, obviously\"},{\"comment_id\":\"10153654511834758\",\"message\":\"No Iran Deal. We believe in saving life, not destroying it. When a country announces the destruction of another country(USA and Isreal). Can the senators and leadership explain why they want to support or fund or lift sanctions on that kind of nation.  Please share and contact your senators.\"},{\"comment_id\":\"10153798756995736\",\"message\":\"John, is Benton County better prepared for elections this November. 4 years ago no paper ballots were counted do to the unpreparedness for voter turn out. My votes needs to count this year. It is my constitutional right to have my vote counted. Thank you.\"}]"]
